catalog={
	"Нидерланды":"Амстердам",
    "Андорра":"Андорра-ла-Велья",
    "Греция":"Афины",
    "Сербия":"Белград",
    "Германия":"Берлин",
    "Швейцария":"Берн",
    "Словакия":"Братислава",
    "Бельгия":"Брюссель",
    "Венгрия":"Будапешт",
    "Румыния":"Бухарест",
    "Лихтенштейн":"Вадуц",
    "Мальта":"Валлетта",
    "Польша":"Варшава",
    "Ватикан":"Ватикан",
    "Австрия":"Вена",
    "Литва":"Вильнюс",
    "Ирландия":"Дублин",
    "Хорватия":"Загреб",
    "Украина":"Киев",
    "Молдавия":"Кишинёв",
    "Дания":"Копенгаген",
    "Португалия":"Лиссабон",
    "Великобритания":"Лондон",
    "Словения":"Любляна",
    "Люксембург":"Люксембург",
    "Испания":"Мадрид",
    "Беларусь":"Минск",
    "Монако":"Монако",
    "Россия":"Москва",
    "Норвегия":"Осло",
    "Франция":"Париж",
    "Черногория":"Подгорица",
    "Чехия":"Прага",
    "Исландия":"Рейкьявик",
    "Латвия":"Рига",
    "Италия":"Рим",
    "Сан-Марино":"Сан-Марино",
    "Босния и Герцеговина":"Сараево",
    "Северная Македония":"Скопье",
    "Болгария":"София",
    "Швеция":"Стокгольм",
    "Эстония":"Таллин",
    "Албания":"Тирана",
    "Финляндия":"Хельсинки"
}

while True:
    print('Список возможных действий:')
    print('1 - Добавить навую страну')
    print('2 - Поиск страны по названию')
    print('3 - Удаление страны из каталога')
    print('4 - Показать информацию о всех странах в каталоге')
    print('0 - Закончить работу')
    print("-" * 100)
    choice = int(input('Введите число: '))
    if choice == 1:
        new_country = input('Введите название страны: ')
        new_capital = input('Введите столицу страны: ')
        if new_country not in catalog:
            catalog[new_country] = new_capital
            print("-" * 100)
        else:
            print('Страна уже есть')
            print("-" * 100)
    elif choice == 2:
        seek_country = input('Введите страну: ')
        if seek_country in catalog:
            print(f'{seek_country}: '+  catalog[seek_country])
            print("-" * 100)
        else:
            print('Страны нету')
            print("-" * 100)
    elif choice == 3:
        delete_country = input('Введите страну для удаления: ')
        if delete_country in catalog:
            catalog.pop(delete_country)
            print('Страна удалена')
            print("-" * 100)
        else:
            print('Страны нету в словаре')
    elif choice == 4:
        for k,v in catalog.items():
            print(k,v)
        print("-" * 100)
    elif choice == 0:
        break